
// Lab_03_1.cpp
// < Якиміва Ореста >
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 27
#include <iostream>
#include <cmath>
using namespace std;
int main()
{
	double x; // вхідний параметр
	double y; // результат обчислення виразу
	double A; // проміжний результат - функціонально стала частина виразу
	double B; // проміжний результат - функціонально змінна частина виразу
	cout << "x = "; cin >> x;

	A = fabs(9*(x*x*x)+2);
	// спосіб 1: розгалуження в скороченій формі
	if (x<4)
		B = 3*pow(x,5)-pow(x,3)+2*x-1;
	if (4 <= x && x < 7)
		B = (atan(x - 2) / 2);
	if (x>=7)
		B = 2*log10((x,-1)+  exp(3 * x +1));
	y = A + B;
	cout << endl;
	cout << "1) y = " << y << endl;
	// спосіб 2: розгалуження в повній формі
	if (x < 4)
		B = 3*pow(x, 5) - pow(x, 3) + 2 * x - 1;
	else
		if (4 <= x && x < 7)
			B = (atan(x - 2) / 2);
			
		else B =2*log10((x, -1) + exp(3 * x + 1));
			
	y = A + B;
	cout << "2) y = " << y << endl;
	cin.get();
	return 0;
}

